# running in proofmsb/src/
read -formal syn_wrongmsb.v
read -formal wrongmsb.v
read -formal topmsb.v
prep -topmsb topmsb

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
